#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/*
1.  Для двух массивов вещественных чисел А и В длиной M и N
соответственно определим процедуру сравнения следующим
образом: A<B если после упорядочивания каждого из этих массивов
по возрастанию его элементов для всех i выполнено 
неравeнство A[i] < B[i], при этом, если i выходит за границы
индексов какого-то из массивов, то вместо значения i-го элемента
рассматривается максимальное значение в соответствующем массиве. 
Для двух заданных массивов А и В нужно проверить выполнение 
неравенства A < B.
*/

double read_array(FILE *f, int *n)
{

}




